Emagician-Lamp.org
#+title: Distillation of thee spirit into thee medium
* Moar Yow
  It's like the previous generation (yow) 
  with the current one (moar).

** Cookie format
   Cookie files are really easy:
#+begin_example
stuff
stuff
%%
other stuff
other stuff
#+end_example

   This gives us an interesting opportunity to display a random something.  For an emagician, one may want to display the following:
   - a "psychological workout" task for the day
   - a card of personal meaning (tarot, I-Ching, Discordian tarot, whatevs)
   - a personal challange to overcome for that day.
   - A note of wisdom. 

** Code


#+begin_src emacs-lisp
  (defun emagician/cookie () 
    "return a piece of wisdom from the collected works of chaos"
    (let ((cookie-delimiter "\n%%\n")
          (curr-buff (current-buffer)))
      (cookie (expand-file-name "assets/collected-chaos.lines" emagician-dir)
              "Loading Chaotic Wisdom..."
              "Loaded!")))
#+end_src

*** TODO Om Nom
**** NEXT write simple chunk to display a cookie

** Content

*** Collected works of Chaos									:asset:lines:
	Sources:
	- Principia Discorida
	- On formerally undecidable propositions of the Principia Discorida and other related systems
	- Thee Grey Book 
#+begin_src cookie :tangle assets/collected-chaos.lines
A jug of wine,
A leg of lamb
And thou!
Beside me,
Whistling in 
the darkness.

Be Ye Not Lost Among Precepts of Order...
  - The Book of Uterus 1;5
%%
GREATER POOP:Are you really serious or what?
MAL-2: Sometimes I take humor seriously. Sometimes I take seriousness
humorously. Either way it is irrelevant.
%%
GREATER-POOP: Maybe you are just crazy.
MAL-2: Indeed! But do not reject these teaching as false because I am crazy. The
reason that I am crazy is because they are true.
%%
GREATER-POOP: Is Eris true?
MAL-2: Everything is true.
GREATER-POOP: Even false things?
MAL-2: Even false things are true.
GREATER-POOP: How can that be?
MAL-2: I don't know man, I didn't do it.
%%
GREATER-POOP: Why do you deal with so many negatives?
MAL-2: To dissolve them.
GREATER-POOP: Will you develop that point?
MAL-2: No.
%%
GREATER-POOP: Is there an essential meaning behind POEE?
MAL-2: There is a Zen Story about a student who asked a Master to explain the
meaning of Buddhism. The Master's reply was "Three pounds of flax."
GREATER-POOP: Is that the answer to my question?
MAL-2: No, of course not. That is just illustrative. The answer to your question
is FIVE TONS OF FLAX!
%%
SUSPENDED ANNIHILATION
%%
POEE
is one manifestation of
THE DISCORDIAN SOCIETY
about which
you will learn more
and understand
less
%%
We
are a tribe
of philosophers, theologians,
magicians, scientists,
artists, clowns,
and similar maniacs
who are intrigued
with
ERIS
GODDESS OF CONFUSION
and with
Her
Doings
%%
I Tell You: One must 
still have chaos in one
 to give birth to a
 dancing star! 
-Nietzsche
%%
Pentabarf I - There is no Goddess but Goddess and She is Your Goddess. There is no
Erisian Movement but The Erisian Movement and it is The Erisian Movement. And
every Golden Apple Corps is the beloved home of a Golden Worm.
%%
Pentabarf II - A Discordian Shall Always use the Official Discordian Document Numbering
System.
%%
Pentabarf III - A Discordian is Required during his early Illumination to Go Off Alone &
Partake Joyously of a Hot Dog on a Friday; this Devotive Ceremony to
Remonstrate against the popular Paganisms of the Day: of Catholic Christendom
(no meat on Friday), of Judaism (no meat of Pork), of Hindic Peoples (no meat
of Beef), of Buddhists (no meat of animal), and of Discordians (no Hot Dog
Buns).
%%
Pentabarf IV - A Discordian shall Partake of No Hot Dog Buns, for Such was the Solace of
Our Goddess when She was Confronted with The Original Snub.
%%
Pentabarf V - A Discordian is Prohibited of Believing What he reads.
%%
IT IS SO WRITTEN! SO BE IT. HAIL DISCORDIA! PROSECUTORS WILL BE
TRANSGRESSICUTED. 
%%
Test Question from Topanga Cabal The Twelve Famous Buddha Minds School: If
they are our brothers, how come we can't eat them?
%%
Western Union Telegram
%%
To: Jehova Yahweh
Care: Celestial Hotel (Suite #666)
Presidential Tier, Paradise

Dear God;
This is to inform you that your current position as diety is herewith
terminated due to gross incompetence STOP  Your check will be mailed STOP 
Please do not use me for a reference

	Respectfully,
		Malaclypse the Younger/Omnibenevolent Polyfather
		POEE High Priest
%%
ON PRAYER

Mal-2 was once asked by one of his Disciples if he often prayed to Eris. He
replied with these words:

No, we Erisians seldom pray, it is much too dangerous. Charles Fort has
listed many factual incidences of ignorant people confronted with, say, a
drought, and then praying fervently -- and then getting the entire village
wiped out in a torrential flood.
%%
"Of course I'm crazy, but that doesn't mean I'm wrong. I'm mad but not ill"
			(Werewolf Bridge, Robert Anton Wison)
%%
4. Wipe thine ass with what is written and grin like a ninny at what is
Spoken. Take thine refuge with thine wine in the Nothing behind Everything,
as you hurry along the Path.
	THE PURPLE SAGE
	HBT; The Book of Predictions, Chap. 19

%%
Heaven is down. Hell is up.
This is proven by the fact 
that the planets and stars 
are orderly in their
movements,					
while down on earth			
we come close to the 
primal chaos.
There are four other
proofs,
but I forget them.

	-Josh the Dill
	 King Kong Kabal
%%
				IT IS MY FIRM BELIEF THAT IT IS A MISTAKE
				TO HOLD FIRM BELIEFS.
%%
IGNOTUM PER IGNOTIUS		  
The meaning of this is unknown
%%
			      THE INSIDE STORY!

       The Law of Fives

	the Law of Fives is one of the oldest Erisian Mysterees. It was first
revealed to Good Lord Omar and is one of the great contributions to come from
The Hidden Temple of The Happy Jesus.
	POEE subscribes to the Law of Fives of Omar's sect. And POEE also
recognizes the holy 23 (2+3=5) that is incorporated by Episkopos Dr. Mordecai
Malignatus, KNS, into his Discordian sect, The Ancient Illuminated Seers of
Bavaria. 
	The Law of Fives states simply that: ALL THINGS HAPPEN IN FIVES, OR
ARE DIVISIBLE BY OR ARE MULTIPLES OF FIVE, OR ARE SOMEHOW DIRECTLY OR
INDIRECTLY APPROPRIATE TO 5.
	The Law of Fives is never wrong.
	In the Erisian Archives is an old memo from Omar to Mal-2: "I find the
Law of Fives to be more and more manifest the harder I look."
%%
						Please do not use this
						document as toilet tissue
%%
	The Nagas of Upper Burma say that the sun
	shines by day because, being a woman, it
	is afraid to venture out at night.
%%

				 REMEMBER:
				 KING
 				  KONG
				 DIED FOR
				 YOUR SINS

%%
							Ho Chi Zen
							   is
							King Cong
%%
Mr. Momomoto, famous Japanese who can swallow his nose,has been
exposed. It was recently revealed that it was Mr. Momomoto's brother who has
been doing all this nose swallowing.

%%				
					Heute Die Welt
					Morgens das Sonnensystem!
%%
Heute Kopfhörer
KlangenSystem am
%%

The Hidden stone ripens fast,
then laid bare like a turnip
can easily be cut out at last
but even then the danger isn't past.
That man lives best who's fain
to live half mad, half sane.
	-Flemish Poet Jan Van 
	 Stijevoort, 1524.
%%


find the goddess Eris				
Within your Pineal Gland            
      POEE		  		         	
						            
%%
To Diverse Gods 		 						            
Do Mortals bow;			 						            
Holy Cow, and			 
Wholly Chao				 
   -Rev. Dr. Grindlebone 
    Monroe Cabal         
%%
"common sense is what tells you that the world is flat."
%%
This is St. Gulik. He is the Messenger of the Goddess. A different age from
ours called him Hermes. Many people called him by many names. He is a Roach
%%
			   When in Doubt, Fuck it.
		      When not in Doubt... get in Doubt!
%%
			    THE POEE MYSTEREE OATH        G3400
							    50
The Initiate swears the following:                         DMTS
                                                            19
	FLYING BABY SHIT!!!!!

(Brothers of the Ancient Illuminated Seers of Bavaria sect may wish to
substitute the German:
	FLIEGENDE KINDERSCHEISSE!
or perhaps
	WIECZNY KWIAT WTADZA!!!!!
which is Ewige Blumenkraft in Polish.)
%%
THE RECENT EXPOSE THAT MR. MOMOMOTO, FAMOUS JAPANESE WHO CAN SWALLOW HIS NOSE,
CANNOT SWALLOW HIS NOSE BUT HIS BROTHER CAN, HAS BEEN EXPOSED! IT IS MR.
MOMOMOTO WHO CAN SWALLOW HIS NOSE. HE SWALLOWED HIS BROTHER IN THE SUMMER OF
'44. 
%%
Corrections to last week's copy: Johnny Sample is offensive cornerback for the
New York Jets, not fullback as stated. Bobby Tolan's name is not Randy, but
mud. All power to the people, and ban the fucking bomb.
%%

						"This statement is false"
						   (courtesy of POEE)
%%
		       THE BEARER OF THIS EMACS
		     IS A GENUINE AND AUTHORIZED
			       ~ POPE ~
		      So please Treat Him Right
			     GOOD FOREVER

       Genuine and authorized by The House of Apostles of ERIS
%%
SINISTER DEXTER HAS A BROKEN SPIROMETER.
%%
Hey Man...Great! I feel goofy, the way my old man looks when he's drunk. 
%%
			  CONVENTIONAL CHAOS

GREYFACE

In the year 1166 B.C., a malcontented hunchbrain by the name of
Greyface, got it into his head that the universe was as humorless as
he, and he began to teach that play was sinful because it contradicted
the ways of Serious Order. "Look at all the order around you," he
said. And from that, he deluded honest men to believe that reality was
a straightjacket affair and not the happy romance as men had known it.

It is not presently understood why men were so gullible at that
particular time, for absolutely no one thought to observe all the
disorder around them and conclude just the opposite. But anyway,
Greyface and his followers took the game of playing at life more
seriously than they took life itself and were known even to destroy
other living beings whose ways of life differed from their own.

The unfortunate result of this is that mankind has since been
suffering from a psychological and spiritual imbalance. Imbalance causes
frustration, and frustration causes fear. And fear makes for a bad trip. Man
has been on a bad trip for a long time now.

It is called THE CURSE OF GREYFACE.
%%
						Bullshit makes the flowers
						grow & that's beautiful.
%%
Climb into the Chao with a friend or two
And follow the Way it carries you,
Adrift like a Lunatic Lifeboat Crew
Over the Waves in whatever you do.
	(HBT; The Book of Advise, 1:3)
%%
IF THE TELEPHONE RINGS TODAY..... WATER IT!
	-Rev. Thomas, Gnostic
	 N.Y.C. Cabal
%%

				   Personal
PLANETARY Pi, which I discovered, is 61. It's a Time-Energy relationship
existing between sun and inner plants and I use it in arriving at many facts
unknown to science. For example, multiply nude earth's circumference
24,902.20656 by 61 and you get the distance of moon's orbit around the earth.
This is slightly less than the actual distance because we have not yet
considered earth's atmosphere. So be it. Christopher Garth, Evanston
%%

"I should have been a plumber."
	--Albert Einstein
%%

			 = ZARATHUD'S ENLIGHTENMENT =

	Before he became a hermit, Zarathud was a young Priest, and took great
delight in making fools of his opponents in front of his followers.

	One day Zarathud took his students to a pleasant pasture and there he
confronted The Sacred Chao while She was contentedly grazing.

	"Tell me, you dumb beast." demanded the Priest in his commanding voice,
"why don't you do something worthwhile. What is your Purpose in Life, anyway?"

	Munching the tasty grass, The Sacred Chao replied "MU".*

	Upon hearing this, absolutely nobody was enlightened. Primarily because
nobody could understand Chinese.

 * "MU" is the Chinese ideogram for NO-THING

%%
TAO FA TSU-DAN                                      FIND PEACE WITH A 
                        						    CONTENTED CHAO
%%

	"Everything is true - Everything is permissible!"            -><-
						-Hassan i Sabbah
%%
There is serenity in Chaos.
Seek ye the Eye of the Hurricane.

%%
"Study Demonology with an Enemy This Sunday"
			sez Thom,Gnos
%%
	"In a way, we're a kind of Peace Corps."
	- Maj. A. Lincoln German, Training Director of the
	  Green Beret Special Warfare School, Ft. Bragg, N.C.
%%
Q. "How come a woodpecker doesn't bash its brains out?" A. Nobody has ever
explained that.
%%
Mary Jane says "Plant Your Seeds. Keep Prices Down."

"And God said, behold, I have given you every herb bearing seed, which is upon
the face of the earth... to you it shall be for meat."
				-Genesis 1:29
%%
Chant of Z'aint Rumsfeld

There are known knowns; there are things we know that we know.
There are known unknowns; that is to say there are things that, we now know we don't know.
But there are also unknown unknowns – there are things we do not know we don't know.
But there are also unknown knowns - there are things we know, but we don't know we know.
%%
"Nothing is true. Everything is Permissible"
			- Hassan i Sabbah
%%
TELL NO ONE! ACCIDENTS HAVE A STRANGE WAY OF HAPPENING TO PEOPLE WHO TALK TOO
		      MUCH ABOUT THE BAVARIAN ILLUMINATI
%%
May we warn you against imitations! Ours is the original and genuine
%%
And when men become free then mankind will be free.
May you be free of The Curse of Greyface.
May the Goddess put twinkles in your eyes.
May you have the knowledge of a sage,
    and the wisdom of a child.
Hail Eris.	
%%
There is Disco in Discordia.
%%
Praise be to Eris
Dark bitch of Chaos
Who's turgid confusion
Gives the illusion
Ov a creator. It's ...baseless
                   ...nameless
                   ...faceless
                   ...fallacious
%%
Beware of enlightened
masters who say 
they don't want money.
The hell they don't.
What they want is more money.
Much more.
%%
Declaring that you own an idea is like trying to own air.
%%
What we need is a way to inspire the future to be interested in...

S P A C E   T R A V E L
%%
Yesterdays Discordian was a hippy, steeped in patchuli.
Today's Discordian is steeped tradition.
Tomorrows Discoridan is steeped in culture.  Remixing at will.
%%
Our enemies are flat.
Our enemies are three-dimensional.
Our enemies are continuity and coherence.
Our enemies are restriction and confinement.
Our enemies are guilt and fear.
Our enemies are material.
Our enemies are direction and fact.
Our enemies are Because.
%%
Grey Book Texts - I
To say in day-to-day life that something is "obvious" means, more often than not, that one concedes a note of truth in exchange for a tolerance of the usual hypocrisy and conditioning. You can, for example, make your opposite admit as being obvious that there is no such thing as a theory that is absolutely true; that will not stop them in any way from continuing to brandish their "Truths" as before.
Hence, there is no higher aim than the OBVIOUS. It is to approach the closest to a Truth which we know to be inaccessible but whose gleam we can see.
The Obvious is a protection. Not only does it make people run away, but it also deceives by its rapid commonness, and by the fact that in Flat people's minds, whatever is simple cannot be serious.
%%
Grey Book Texts - II
An Individual has many personalities or characters at the same time or alternately. (Recent cognitive brain theory supports this.) 
Most people little by little eliminate the personalities considered to be dangerous by their peer group or societal unit and finally keep only one: the social personality... one-dimensional "FLAT" people. But other people, called paradoxically "Individuals", are always trying to develop all their personalities, even if there is an internal conflict between them. So we can clearly see that the Individualist person logically must use "WE" to name himself, whilst the person who belongs to the masses must use the "I". The first is multi-dimensional, the second is uni-dimensional.
One of the Temple functions is to encourage and support the development of multi-dimensional Individuals. Hence our use of "WE" in our texts.
Our enemies are Flat.
%%
Grey Book Texts - III
Our stress on SELF discipline is important, it links the internal methods of ritual to our approval and suggestion of other forms of physical discipline to complement the mental/sexual ones. Hence you will often find that Initiates of the Temple will be engaged in such outside activities as Marksmanship, Martial Arts, Swimming and so on as an extension of the theory of maintaining and improving one's focus and abilities.
The point is not the skill in itself, though we appreciate the practical nature, in a society such as ours, of an Ability to defend oneself and be fit, but the APPLICATION, the discipl1ne itself. So one may be poor in terms of results, but excellent in terms of your genuine application to a skill that requires thought, co-ordination and a degree of dedication. A synthesis of physical action, thought, reflex and an analysis of both yourself and a target (real or metaphysical.
%%
I must not fear.
Fear is the mind-killer.
Fear is the little-death that brings total obliteration.
I will face my fear.
I will permit it to pass over me and through me.
And when it has gone past I will turn the inner eye to see its path.
Where the fear has gone there will be nothing.
Only I will remain.
%%
Consult Your Pineal Gland.
%%
"For when you look within the parens / the enemy that lurks within
		  is but the closure of your mind"
APOLK, Rite of the Parenthetical Hierophant, 16°=60°
#+end_src


* Learning Emacs through Achievements
#+begin_src emacs-lisp
  (add-to-list 'load-path (expand-file-name "dist/emacs-achievements" emagician-dir))  
  (require 'achievements)
#+end_src

* Learning to Spell I
** ispell-command-loop after advice

#+name: emagician/fix-mm-commentary
#+begin_src org
  ,  
  ,  This file is part of the emagicians starter kit, which is available
  ,  here: https://github.com/jonnay/emagicians-starter-kit
  ,  
  ,  Note that if you are using this .el file, you probably aren't using
  ,  the emagicians sarter kit, which is fine. You dont need this for
  ,  that.
  
  ,* Motivation
  
  ,  I used to type 'necessary' wrong... ALL THE TIME. I misspelled it so
  ,  often that it became part of my muscle memory.  It is one of *THOSE*
  ,  words for me.  There are others, that by muscle, or brain memory,
  ,  are "burned in" as a particular pattern.
  , 
  ,  This is an attempt to break that pattern, by forcing you to re-type
  ,  your misspelled words 3 times.  This should help overcome any broken
  ,  muscle and brain memory.
  
  ,* Usage
  
  ,  - Step 1 :: Require this file
  ,  - Step 2 :: Use M-$ to check the spelling of your misspelled word
  ,  - Step 3 :: follow the directions of the prompt
  
  ,* Changelog
  
  ,  - v 0.1 :: First Version
  ,  - v 0.2 :: 
  ,    - Minor documentation fix. 
  ,  - v 0.3 ::
  ,    - Fix bug when using ispell 
#+end_src

#+name: emagician/fix-mm-advice
#+begin_src emacs-lisp
  (defadvice ispell-command-loop (after emagician/fix-muscle-memory last activate)
    "Force the user to type in the misspelled/mis-typoed word 3 times, to burn it into muscle memory."
    (let* ((total-times 3)
           (times (if (null ad-return-value)
                      total-times 
                    0)))
      (while (< times total-times)
        (setq times
              (+ times (if (string= (read-string (format "Re-type \"%s\" correctly (%d/%d): "  ad-return-value times total-times))
                                    ad-return-value)
                       1
                     -1))))))
#+end_src

** Simple output .el for MELPA

#+begin_src emacs-lisp :tangle emagician-fix-spell-memory.el  :noweb yes :padline no
  ;;; emagician-fix-spelling. --- Simple hack into ispell to fix (muscle) memory problems
 
  ;; Copyright (C) 2012 Jonathan Arkell
  
  ;; Author: Jonathan Arkell <jonnay@jonnay.net>
  ;; Created: 5 Oct 2012
  ;; Keywords: erc bitlbee bot
  ;; Version 0.1
  
  ;; This file is not part of GNU Emacs.
  ;; Released under the GPL v3.0
  
  ;;; Commentary:
  ;; <<emagician/fix-mm-commentary>>
  
  ;;; Code:
  
  <<emagician/fix-mm-advice>>
  
  (provide 'emagician-fix-spell-memory)
  
  ;;; emagician-fix-spell-memory ends here
#+end_src

** Test Melpa recipe 

   This test code is kinda crappy, but it works.

*** TODO move this code into emagician proper 

	Initialize package-build for... you know... building

#+begin_src emacs-lisp :tangle no
  (let* ((melpa-dir (concat (file-name-directory (buffer-file-name))
                            "melpa/")))
    (setq package-build-recipes-dir (concat melpa-dir "recipes"))
    (setq package-build-working-dir (concat melpa-dir "working"))
    (setq package-build-archive-dir (concat melpa-dir "packages")))
  (add-to-list 'load-path (concat (file-name-directory (buffer-file-name)) "melpa"))
  (require 'package-build)
#+end_src

	GO!

#+begin_src emacs-lisp :tangle no 
  (when nil
    (progn
      (setq package-build-alist (assq-delete-all 'emagician-fix-spell-memory package-build-alist))
      (package-build-initialize)
      (package-build-archive 'emagician-fix-spell-memory)
    )
    ; Blank line for easier execution
    )    
#+end_src

** TODO Update package to muscle memory bound keys
*** NEXT find hook point. Start with helm, go from there
*** NEXT see if we can get the proper key combo 
